tutorials/D4PassiveScalarTransport/Allrun
#!/bin/bash
# Load OpenFOAM run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

CASE_DIR="$(CDPATH= cd -- "$(dirname -- "$0")" && pwd)"

# User settings, overridable through environment variables
TABLERESOLUTION="${TABLERESOLUTION:-51}"      # select table resolution (2, 21, 31, 41, 46, 51)
PARALLEL="${PARALLEL:-true}"                  # parallel mode?
NPROCS="${NPROCS:-4}"                         # number of MPI ranks when parallel
HEAPTRACK="${HEAPTRACK:-false}"               # profile solver with heaptrack?
HEAPTRACK_OUT="${HEAPTRACK_OUT:-}"            # optional explicit heaptrack output file

runSolver()
{
    if [ "$HEAPTRACK" = true ]; then
        echo "Running under heaptrack: $*"
        if [ -n "$HEAPTRACK_OUT" ]; then
            heaptrack --record-only -o "$HEAPTRACK_OUT" "$@"
        else
            heaptrack --record-only "$@"
        fi
    else
        "$@"
    fi
}

cd "$CASE_DIR" || exit 1

# Copy initial conditions
cp -rf 0_orig 0

# Create Mesh
runApplication blockMesh

# Create Tables
python3 ./python/tableGenerator.py $TABLERESOLUTION

# Create mesh
runApplication blockMesh

if [ "$PARALLEL" = true ]; then
    if [ "$HEAPTRACK" = true ]; then
        echo "HEAPTRACK=true is currently only supported for serial runs." >&2
        exit 1
    fi

    sed -i "s/^numberOfSubdomains[[:space:]].*;/numberOfSubdomains $NPROCS;/" \
        system/decomposeParDict

    # Decompose case
    runApplication decomposePar

    # Run solver in parallel
    runApplication mpirun -np "$NPROCS" bwRSE4HPCFoam -parallel

    # Reconstruct results
    runApplication reconstructPar

    # Remove processor directories
    rm -rf processor*
else
    # Serial run
    if [ "$HEAPTRACK" = true ]; then
        runSolver bwRSE4HPCFoam 2>&1 | tee log.bwRSE4HPCFoam
    else
        runApplication bwRSE4HPCFoam
    fi
fi

# Create ParaView/OpenFOAM reader marker
touch "$CASE_DIR/D4PassiveScalarTransport.foam"
